app/controllers/admin/administrators_controller.rb

SELECT `administrators`.* FROM `administrators`
---
  def index
    @administrators = Administrator.all

SELECT `administrators`.* FROM `administrators` WHERE `administrators`.`id` = 1 LIMIT 1
---
  def edit
    @administrator = Administrator.find(params[:id])