app/controllers/admin/blogs_controller.rb

SELECT `blogs`.* FROM `blogs` ORDER BY `blogs`.`created_at` ASC
---
  def index
    @search = Blog.search(params[:search])

SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
---
  def edit
    @blog = Blog.find(params[:id])

INSERT INTO `blogs` (`title`, `content`, `category_id`, `is_public`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `public_datetime`, `created_at`, `updated_at`) VALUES ('qqweqwe', 'qweqwe', 1, NULL, NULL, NULL, NULL, NULL, NULL, '2011-10-17 08:15:22', '2011-10-17 08:15:22')
---
  def create
    @blog = Blog.new(params[:blog])

#    render :update do |page|
#        page.alert('sss')
#      if @blog.save
#        page.alert('sss')
#      else
#        page.alert(@blog.errors.full_messages.join("\n"))
#      end
#    end

    respond_to do |format|
      if @blog.save

SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
UPDATE `blogs` SET `content` = 'qweqweqwe', `updated_at` = '2011-10-17 08:15:27' WHERE `blogs`.`id` = 1
---
  def update
    @blog = Blog.find(params[:id])

    respond_to do |format|
      if @blog.update_attributes(params[:blog])