app/controllers/admin/categories_controller.rb

  def index

    @title = t("h2.categories")
    @search = Category.search(params[:search])

    p  @search
    unless params[:keyword].blank?
      p 222222222222222222222
      name = split_keyword(params[:keyword])

      @search.name_like = params[:keyword]
      #      @search.or_content_like = name
      #      @search.or_email_like = name
    end

#      Article.where((:name =~ 'Hello%') | (:content =~ 'Goodbye%')).to_sql


    @categories = @search.paginate(:page => params[:page])
---
SELECT `categories`.* FROM `categories`
SELECT `categories`.* FROM `categories` WHERE (`categories`.`name` LIKE '%adf%') AND (`categories`.`name` LIKE '%adf%')

  def edit
    @title = t("h2.categories")
    @category = Category.find(params[:id])
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('adfafdasdf', '2011-10-17 08:11:59', '2011-10-17 08:11:59')

  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
UPDATE `categories` SET `name` = 'adfafdasdf111111', `updated_at` = '2011-10-17 08:15:15' WHERE `categories`.`id` = 1