app/controllers/admin/sabro_firsts_controller.rb

SELECT `sabro_firsts`.* FROM `sabro_firsts` WHERE (name like '%'12'%' )
SELECT COUNT(*) FROM `sabro_firsts` WHERE `sabro_firsts`.`name` = ''
SELECT `sabro_firsts`.* FROM `sabro_firsts` WHERE ((`sabro_firsts`.`name` LIKE '%23%' OR `sabro_firsts`.`email` LIKE '%23%')) AND ((`sabro_firsts`.`email` LIKE '%213%' OR `sabro_firsts`.`name` LIKE '%213%')) LIMIT 30 OFFSET 0
---
  def index

    @title = t("h2.sabro_firsts")
    @search = SabroFirst.search(params[:search])

    p  @search
    unless params[:keyword].blank?
      p 222222222222222222222
      name = split_keyword(params[:keyword])

      @search.email_or_name_like = params[:keyword]
      #      @search.or_content_like = name
      #      @search.or_email_like = name
    end

#      Article.where((:name =~ 'Hello%') | (:content =~ 'Goodbye%')).to_sql


    @sabro_firsts = @search.paginate(:page => params[:page])

SELECT `sabro_firsts`.* FROM `sabro_firsts` WHERE `sabro_firsts`.`id` = 2 LIMIT 1
---
  def edit
    @title = t("h2.sabro_firsts")
    @sabro_first = SabroFirst.find(params[:id])

INSERT INTO `sabro_firsts` (`name`, `email`, `content`, `created_at`, `updated_at`) VALUES ('', '', '', '2011-03-23 09:12:28', '2011-03-23 09:12:28')
---
  def create
    @sabro_first = SabroFirst.new(params[:sabro_first])

    respond_to do |format|
      if @sabro_first.save