app/controllers/blogs_controller.rb

SELECT `blogs`.* FROM `blogs`
---
  def index
    @blogs = Blog.all

SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
---
  def show
    @blog = Blog.find(params[:id])

SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 2 LIMIT 1
---
  def edit
    @blog = Blog.find(params[:id])

INSERT INTO `blogs` (`title`, `content`, `is_public`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `public_datetime`, `created_at`, `updated_at`) VALUES ('asdfaf', 'adfa', 1, NULL, NULL, NULL, NULL, '2011-08-02 07:10:00', '2011-08-02 07:10:09', '2011-08-02 07:10:09')
---
  def create
    @blog = Blog.new(params[:blog])

    render :update do |page|
      if @blog.save

SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 2 LIMIT 1
UPDATE `blogs` SET `content` = '人人wwwwwwwqrty,bvcx', `updated_at` = '2011-08-03 06:36:16' WHERE `blogs`.`id` = 1
---
  def update
    @blog = Blog.find(params[:id])


        render :update do |page|
      if @blog.update_attributes(params[:blog])