app/views/admin/blogs/_form.html.erb

      <td>
        <%= form.select  :category_id ,Category.all.collect{|c|[c.name , c.id]} %>
---
SELECT `categories`.* FROM `categories`